<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [2]:
import pandas as pd
import psycopg2

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [5]:
# текст запроса
query_3_1 = f'''select 
            count (*)
            from vacancies
'''

In [6]:
# результат запроса
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\84\AppData\Local\Temp\ipykernel_17824\1114379196.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [7]:
query_3_2 = f'''select
            count (*)
            from employers
'''

In [8]:
df = pd.read_sql_query(query_3_2, connection)
df

C:\Users\84\AppData\Local\Temp\ipykernel_17824\3588252056.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_2, connection)

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [9]:
query_3_3 = f'''select
            count (*)
            from areas
'''

In [10]:
df = pd.read_sql_query(query_3_3, connection)
df

C:\Users\84\AppData\Local\Temp\ipykernel_17824\2018224393.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_3, connection)

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [11]:
query_3_4 = f'''select
            count (*)
            from industries
'''

In [12]:
df = pd.read_sql_query(query_3_4, connection)
df

C:\Users\84\AppData\Local\Temp\ipykernel_17824\2172479966.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_4, connection)

   count
0    294

***

* Относительно небольшое количество вакансий (учитывая уровень безработицы)
* Много компаний
* Кол-во регионов предполагает вакансии не только по России
* Широкий охват сфер деят-ти

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [13]:
query_4_1 = f'''select
    a.name area,
    count(v.id) cnt
from areas a 
join vacancies v on a.id=v.area_id
group by a.name
order by count (v.id) desc
limit 5

'''

In [54]:
df = pd.read_sql_query(query_4_1, connection)
df

C:\Users\84\AppData\Local\Temp\ipykernel_17824\347208320.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_1, connection)

              area   cnt
0           Москва  5333
1  Санкт-Петербург  2851
2            Минск  2112
3      Новосибирск  2006
4           Алматы  1892

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [55]:
query_4_2 = f'''select
    count (*)
from vacancies
where salary_from is not null or salary_to is not null
'''

In [56]:
df = pd.read_sql_query(query_4_2, connection)
df

C:\Users\84\AppData\Local\Temp\ipykernel_17824\2168503709.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_2, connection)

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [84]:
query_4_3 = f'''select
    round(avg(salary_to)) "верхняя",
    round(avg(salary_from)) "нижняя"
from vacancies
'''

In [85]:
df = pd.read_sql_query(query_4_3, connection)
df

C:\Users\84\AppData\Local\Temp\ipykernel_17824\2222372203.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_3, connection)

    верхняя   нижняя
0  110537.0  71065.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [69]:
query_4_4 = f'''select distinct
    schedule,
    employment,
    count(id)
from vacancies
group by 1, 2
order by 3 desc
limit 2    
'''

In [70]:
df = pd.read_sql_query(query_4_4, connection)
df

C:\Users\84\AppData\Local\Temp\ipykernel_17824\2981602351.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_4, connection)

           schedule        employment  count
0       Полный день  Полная занятость  35367
1  Удаленная работа  Полная занятость   7802

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [71]:
query_4_5 = f'''select
    experience
from vacancies
group by experience
order by count (id) asc
'''

In [72]:
df = pd.read_sql_query(query_4_5, connection)
df

C:\Users\84\AppData\Local\Temp\ipykernel_17824\2601166264.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_5, connection)

           experience
0         Более 6 лет
1           Нет опыта
2       От 3 до 6 лет
3  От 1 года до 3 лет

***

* В крупных городах больше вакансий
* Половина вакансий предоставляет информанцию о зарплате
* Средняя зарплатная вилка выше средней зарплаты
* Популярные пары график-трудоустройство включают полную занятость
* Самые популярные вакансии для соискателей с высоким стажем или совсем без него

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [73]:
query_5_1 = f'''select
    e.name
from employers e
join vacancies v on e.id=v.employer_id
group by e.name
order by count (v.id) desc
limit 5
'''

In [74]:
df = pd.read_sql_query(query_5_1, connection)
df

C:\Users\84\AppData\Local\Temp\ipykernel_17824\1792814825.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_1, connection)

            name
0         Яндекс
1     Ростелеком
2       Тинькофф
3           СБЕР
4  Газпром нефть

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [86]:
query_5_2 = f'''select
    a.name,
    count(e.name) cnt_employers,
    count(v.id) cnt_vacancies
from areas a
left join vacancies v on a.id = v.area_id
left join employers e on a.id=e.area
group by a.name
having count(v.id) = 0
order by count(e.name) desc
limit 1
'''

In [87]:
df = pd.read_sql_query(query_5_2, connection)
df

C:\Users\84\AppData\Local\Temp\ipykernel_17824\3341481329.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_2, connection)

     name  cnt_employers  cnt_vacancies
0  Россия            410              0

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [78]:
query_5_3 = f'''select 
    e.name employer,
    count (distinct v.area_id) cnt_area
from vacancies v
join employers e on e.id=v.employer_id
where v.area_id is not null
group by employer
order by count (e.area) desc
'''

In [79]:
df = pd.read_sql_query(query_5_3, connection)
df

C:\Users\84\AppData\Local\Temp\ipykernel_17824\2398953733.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_3, connection)

                                    employer  cnt_area
0                                     Яндекс       181
1                                 Ростелеком       152
2                                   Тинькофф        43
3                                       СБЕР        24
4                              Газпром нефть        24
...                                      ...       ...
14761             ПСБ Инновации и Инвестиции         1
14762                             ПСЗ Янтарь         1
14763                                    ПСК         1
14764  Псковский завод механических приводов         1
14765                     ПСК ТатЭнергоСтрой         1

[14766 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [80]:
query_5_4 = f'''select
    count (e.id)
from employers e
left join employers_industries ei on e.id=ei.employer_id
where ei.industry_id is null
'''

In [81]:
df = pd.read_sql_query(query_5_4, connection)
df

C:\Users\84\AppData\Local\Temp\ipykernel_17824\3114411492.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_4, connection)

   count
0   8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [82]:
query_5_5 = f'''select
    e.name
from employers e
join employers_industries ei on e.id=ei.employer_id
group by e.name
having count (ei.industry_id) = 4
order by e.name
offset 2 limit 1
'''

In [83]:
df = pd.read_sql_query(query_5_5, connection)
df

C:\Users\84\AppData\Local\Temp\ipykernel_17824\1650419958.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_5, connection)

   name
0  2ГИС

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [88]:
query_5_6 = f'''select
    i.name,
    count(e.id)
from employers_industries ei 
join employers e on e.id=ei.employer_id
join industries i on i.id=ei.industry_id
where i.name = 'Разработка программного обеспечения'
group by i.name
'''

In [89]:
df = pd.read_sql_query(query_5_6, connection)
df

C:\Users\84\AppData\Local\Temp\ipykernel_17824\1169039133.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_6, connection)

                                  name  count
0  Разработка программного обеспечения   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [90]:
query_5_7 = f'''(select 
    a.name,
    count(v.area_id) cnt
from VACANCIES v
left join AREAS a ON a.id = v.area_id
join employers e on e.id=v.employer_id
where( a.name = 'Москва' or a.name ='Санкт-Петербург' or a.name ='Новосибирск' or a.name ='Екатеринбург' or a.name ='Казань'
or a.name ='Нижний Новгород' or a.name ='Челябинск' or a.name ='Красноярск' or
a.name ='Самара' or a.name ='Уфа' or a.name ='Ростов-на-Дону' or a.name ='Омск' or 
a.name ='Краснодар' or a.name ='Воронеж' or a.name ='Пермь' or a.name ='Волгоград') and e.name = 'Яндекс'
group by a.name
order by 2)

union all
    
(select 
    'total',
    count(v.area_id) cnt
from VACANCIES v
left join AREAS a ON a.id = v.area_id 
join employers e on e.id=v.employer_id
where (a.name = 'Москва' or a.name ='Санкт-Петербург' or a.name ='Новосибирск' or a.name ='Екатеринбург' or a.name ='Казань'
or a.name ='Нижний Новгород' or a.name ='Челябинск' or a.name ='Красноярск' or
a.name ='Самара' or a.name ='Уфа' or a.name ='Ростов-на-Дону' or a.name ='Омск' or 
a.name ='Краснодар' or a.name ='Воронеж' or a.name ='Пермь' or a.name ='Волгоград') and e.name = 'Яндекс'
)
'''

In [96]:
df = pd.read_sql_query(query_5_7, connection)
df.shape

C:\Users\84\AppData\Local\Temp\ipykernel_17824\1108962220.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_7, connection)

(17, 2)

In [92]:
df = pd.read_sql_query(query_5_7, connection)
df

C:\Users\84\AppData\Local\Temp\ipykernel_17824\3129374555.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_7, connection)

               name  cnt
0             total  485
1              Омск   21
2         Челябинск   22
3        Красноярск   23
4         Волгоград   24
5             Пермь   25
6            Казань   25
7    Ростов-на-Дону   25
8               Уфа   26
9            Самара   26
10        Краснодар   30
11          Воронеж   32
12      Новосибирск   35
13  Нижний Новгород   36
14     Екатеринбург   39
15  Санкт-Петербург   42
16           Москва   54

***

* работа в Яндекс - самая распространенная по регионам вакансия
* Шестая часть работодателей не указывает сферу деят-ти
* Каждая 12-ая вакансия по разработке ПО

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [101]:
query_6_1 = f'''select
    count(id)
from vacancies
where name ilike '%data%' or name ilike '%данн%'
'''

In [102]:
df = pd.read_sql_query(query_6_1, connection)
df

C:\Users\84\AppData\Local\Temp\ipykernel_17824\485020324.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_1, connection)

   count
0   1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [103]:
query_6_2 = f'''select 
    count(*)
from vacancies v
where (name ilike '%data scientist%' or name ilike '%data science%' or (name like '%ML%' and name not like '%HTML%')
or name ilike '%machine learning%' or name ilike '%машинн%обучен%') and 
(name ilike '%junior%' or experience ilike '%нет опыта%' or employment ilike '%стажировка%')
'''

In [104]:
df = pd.read_sql_query(query_6_2, connection)
df

C:\Users\84\AppData\Local\Temp\ipykernel_17824\3641650667.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_2, connection)

   count
0     51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [105]:
query_6_3 = f'''select 
    count(*)
from vacancies v
where (name ilike '%data scientist%' or name ilike '%data science%' or (name like '%ML%' and name not like '%HTML%')
or name ilike '%machine learning%' or name ilike '%машинн%обучен%') and 
(key_skills ilike '%sql%' or key_skills ilike '%postgres%')
'''

In [106]:
df = pd.read_sql_query(query_6_3, connection)
df

C:\Users\84\AppData\Local\Temp\ipykernel_17824\1159587760.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_3, connection)

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [107]:
query_6_4 = f'''select 
    count(*)
from vacancies v
where (name ilike '%data scientist%' or name ilike '%data science%' or (name like '%ML%' and name not like '%HTML%')
or name ilike '%machine learning%' or name ilike '%машинн%обучен%') and 
(key_skills ilike '%python%')
'''

In [108]:
df = pd.read_sql_query(query_6_4, connection)
df

C:\Users\84\AppData\Local\Temp\ipykernel_17824\972386973.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_4, connection)

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [113]:
query_6_5 = f''' with datascience AS 
        ((select v.name, v.key_skills
        from vacancies v
        where (v.name ilike '%data scientist%' OR v.name ILIKE '%data science%' OR v.name ILIKE '%исследователь данных%' OR 
        (v.name like '%ML%' AND v.name NOT ILIKE '%HTML%') OR v.name ILIKE '%machine learning%' OR
        v.name ilike '%машинн%обучен%')))
    select round(avg(length(key_skills)-LENGTH(REPLACE(key_skills,CHR(9),''))+1),2) num_skills
    FROM datascience
    WHERE key_skills IS NOT NULL
'''

In [114]:
df = pd.read_sql_query(query_6_5, connection)
df

C:\Users\84\AppData\Local\Temp\ipykernel_17824\390248827.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_5, connection)

   num_skills
0        6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [116]:
query_6_6 = f'''SELECT
    experience,
    ROUND(AVG(COALESCE((salary_to + salary_from)/2, salary_to, salary_from))) average
FROM public.vacancies
WHERE (name ilike '%data scientist%' or name ilike '%data science%' or (name like '%ML%' and name not like '%HTML%')
or name ilike '%machine learning%' or name ilike '%машинн%обучен%')
AND (salary_from IS NOT NULL OR salary_to IS NOT NULL)AND (experience IS NOT NULL)
GROUP BY experience
'''

In [117]:
df = pd.read_sql_query(query_6_6, connection)
df

C:\Users\84\AppData\Local\Temp\ipykernel_17824\3561045109.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_6, connection)

           experience   average
0           Нет опыта   74643.0
1  От 1 года до 3 лет  139675.0
2       От 3 до 6 лет  243115.0

***

* Сравнительно немного вакансий для начинающих специалистов
* Много запросов sql/python среди работодаделей

# Общий вывод по проекту

* Есть широкий выбор вакансий как по регионам, так и по сфере деят-ти
* Большой охват графиков и стажа работы
* Можно найти работу начинающему специалисту, много компаний, больше всего вакансий в Яндексе

In [121]:
#Посмотрим сколько есть вакансий с минимульной ЗП 100к

query_8 = f'''select
    a.name,
    v.name,
    e.name,
    v.salary_from
from vacancies v
join employers e on e.id=v.employer_id
join areas a on a.id=v.area_id
where salary_from > '100000'
order by 1
'''

In [122]:
df = pd.read_sql_query(query_8, connection)
df

C:\Users\84\AppData\Local\Temp\ipykernel_17824\1280661075.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_8, connection)

,name,name,name,salary_from
0,Абакан,Программист 1С,Милюхин Андрей Сергеевич,150000
1,Абакан,"Инженер технического обслуживания систем АПС, ...",Продвижение,120000
2,Абакан,Инженер котельной,ЕВРАЗ,120000
3,Аксай (Казахстан),JAVA - разработчик Senior/Middle,InFinBank,146121
4,Аксай (Казахстан),Android - разработчик Senior/Middle,InFinBank,116897
...,...,...,...,...
3895,Ярославль,Директор научно-исследовательского центра (химия),"Август, Фирма",500000
3896,Ярославль,Начальник отдела по сопровождению номенклатурн...,АЛНАС,140000
3897,Ярославль,Ведущий программист 1C,ООО ЕФИН,150000
3898,Ярославль,Web-разработчик PHP международного сервиса DIK...,DIKIDI,120000
3899,Ярославль,Программист 1C,Окраина,130000